##############################################################################
# Настройка требуемой версии CMake
##############################################################################

  cmake_minimum_required(VERSION 3.9...3.28)

##############################################################################
# Настройка окружения
##############################################################################

  # Использовать модуль установки директории для сборки и файлов CMAKE
  include(build_set_builddir.cmake)

##############################################################################
# Удаление предыдущей директории сборки
##############################################################################

  # Удалить предыдущую директорию сборки
  file(REMOVE_RECURSE "${BUILDDIR}")
