  cmake_minimum_required(VERSION 3.9...3.28)

##############################################################################
# Функция удаления файла нулевой длины
##############################################################################
  include(build_remove_zerofile.cmake)

##############################################################################
# Настройка параметров сборки
##############################################################################

  # Использовать модуль установки генератора для CMAKE
  include(build_set_generator.cmake)

  # Использовать модуль установки конфигурации
  include(build_set_config.cmake)

  # Использовать модуль установки уровня детализации сообщений сборки
  include(build_set_loglevel.cmake)

##############################################################################
# Настройка окружения
##############################################################################

  # Использовать модуль установки пути к исходным текстам
  include(build_set_source.cmake)

  # Использовать модуль установки директории для сборки и файлов CMAKE
  include(build_set_builddir.cmake)

  # Использовать модуль установки компилятора
  include(build_set_compiler.cmake)

  # Использовать модуль установки пути к требуемой версии Qt
  include(build_set_qt.cmake)

##############################################################################
# Удаление предыдущей директории сборки
##############################################################################

  include(build_remove_builddir.cmake)

##############################################################################
# Конфигурирование
##############################################################################

  include(build_config.cmake)
