##############################################################################
# Настройка требуемой версии CMake
##############################################################################

  cmake_minimum_required(VERSION 3.9...3.28)

##############################################################################
# Настройка параметров сборки
##############################################################################

  # Использовать модуль установки генератора для CMAKE
  include(build_set_generator.cmake)

  # Использовать модуль установки конфигурации
  include(build_set_config.cmake)

  # Использовать модуль установки уровня детализации сообщений сборки
  include(build_set_loglevel.cmake)

##############################################################################
# Настройка окружения
##############################################################################

  # Использовать модуль установки пути к исходным текстам
  include(build_set_source.cmake)

  # Использовать модуль установки директории для сборки и файлов CMAKE
  include(build_set_builddir.cmake)

  # Использовать модуль установки компилятора
  include(build_set_compiler.cmake)

  # Использовать модуль установки пути к требуемой версии Qt
  include(build_set_qt.cmake)

##############################################################################
# Построение документации в формате PDF
##############################################################################

  include(build_pdf.cmake)
