##############################################################################
# Установка уровня детализации сообщений сборки
##############################################################################

# Существуют следующие уровни выводимых сообщений:
# FATAL_ERROR - серьёзная ошибка, вызывающая полную остановку сборки;
# set(LOGLEVEL "FATAL_ERROR")
# SEND_ERROR - серьёзная ошибка, вызывающая остановку сборки без остановки выполнения скрипта Cmake;
# set(LOGLEVEL "SEND_ERROR")
# WARNING - предупреждение;
# set(LOGLEVEL "WARNING")
# AUTHOR_WARNING - предупреждение разработчика;
# set(LOGLEVEL "AUTHOR_WARNING")
# DEPRECATION - ошибка или предупреждение об использовании устаревшей функции Cmake;
# set(LOGLEVEL "DEPRECATION")
# NOTICE - важное сообщение, выводимое на устройство stderr;
# set(LOGLEVEL "NOTICE")
# STATUS - краткое важное сообщение (значение по умолчанию);
  set(LOGLEVEL "STATUS")
# VERBOSE - подробная информация об особенностях сборки;
# set(LOGLEVEL "VERBOS"E)
# DEBUG - подробная информация, необходимая только разработчику;
# set(LOGLEVEL "DEBUG")
# TRACE - сообщение о ходе сборки для точного отслеживания процесса.
# set(LOGLEVEL "TRACE")
# Выводятся сообщения от указанного уровня (включая его) и выше.

  if( (NOT DEFINED LOGLEVEL) OR ("^^${LOGLEVEL}" STREQUAL "^^") )
      message(STATUS "SetLoglevel: Уровень выводимых сообщений не определён, будет использовано значение по умолчанию STATUS")
  endif()
