##############################################################################
# Установка конфигурации
##############################################################################

# По умолчанию существуют следующие конфигурации сборки:
# Debug - с отладочной информацией, без оптимизации
  set(CONFIG "Debug")
# Release - без отладочной информации, с оптимизацией по умолчанию, таблицы символов удалены
# set(CONFIG "Release")
# RelWithDebInfo - с отладочной информацией, с оптимизацией по умолчанию
# set(CONFIG "RelWithDebInfo")
# MinSizeRel - без отладочной информации, с оптимизацией размера, таблицы символов удалены
# set(CONFIG "MinSizeRel")

  if( (NOT DEFINED CONFIG) OR ("^^${CONFIG}" STREQUAL "^^") )
      message(STATUS "SetConfig: Конфигурация не определена, будет использовано значение по умолчанию")
  endif()
