/**
 * \file
 * \brief Файл с описанием языка Express
 * (ГОСТ Р ИСО 10303-203-2003).
 */

#ifndef _10303_203_DOC_H
#define _10303_203_DOC_H

/**
 * \defgroup standard_203 Стандарт 10303-203
 * \{
 * \htmlonly
 * <script type="text/javascript">
 * window.onload = addIndent;
 * </script>
 * \endhtmlonly
 * \latexonly
 * \setlength{\parindent}{9.5mm} 
 * \endlatexonly
 * <HR>
 * \anchor p203
 * <CENTER>
 * \image html GOST.png
 * \image latex GOST.png width=1.5cm
 * </CENTER>
 * <CENTER><B>ГОСТ Р ИСО 10303-203-2003</B></CENTER>
 * <HR>
 * <H2>
 * <BR>Системы автоматизации производства и их интеграция ---<BR>
 * ПРЕДСТАВЛЕНИЕ ДАННЫХ ОБ ИЗДЕЛИИ И ОБМЕН ЭТИМИ ДАННЫМИ ---<BR>
 * Часть 203:<BR>
 * Прикладной протокол<BR>
 * Проекты с управляемой конфигурацией
 * </H2>
 *
 * \section p203_s1 1 Область применения
 *
 * Настоящий стандарт определяет интегрированные ресурсы, необходимые для описания области
 * обмена данными между прикладными системами и информационных требований для трехмерных
 * конструкций (проектов) механических деталей и сборочных единиц. Конфигурация в этом контексте
 * охватывает только данные и процессы, которые управляют трехмерными данными о конструкции
 * изделия. Понятие обмена используется с целью распространения области применения стандарта
 * только на данные, используемые как часть трехмерного определения изделия. Организации,
 * обменивающиеся данными в соответствии с настоящим стандартом, могут быть связаны договорными
 * отношениями, которые в стандарте не рассмотрены.
 *
 * <SMALL>П&nbsp;р&nbsp;и&nbsp;м&nbsp;е&nbsp;ч&nbsp;а&nbsp;н&nbsp;и&nbsp;е ---
 * Прикладная функциональная модель (ПФМ), приведенная в приложении Е,
 * определяет графическое представление процессов и информационных потоков в соответствии
 * с областью применения настоящего стандарта.</SMALL>
 *
 * Область применения настоящего стандарта охватывает:<BR>
 * a) изделия, состоящие из механических деталей и сборочных единиц;<BR>
 * b) данные, определяющие изделие и управляющие его конфигурацией, относящиеся к стадии
 * проектирования изделия;<BR>
 * c) изменение проекта (конструкции) и данные, связанные с документированием процесса
 * внесения изменений;<BR>
 * d) пять типов представлений формы детали, которые включают каркасное и поверхностное
 * представления без топологии, каркасную геометрию с топологией, разнородные поверхности с
 * топологией, фасетное граничное представление и граничное представление;<BR>
 * e) альтернативные представления данных по различным правилам (дисциплинам) на стадии
 * проектирования в жизненном цикле изделия;<BR>
 * f) обозначение государственных, отраслевых, фирменных или других спецификаций для проекта
 * (конструкции), процесса, обработки поверхности и материалов, которые определены
 * проектировщиком для конструируемого изделия;<BR>
 * g) государственное, отраслевое, фирменное или прочее обозначение стандартных частей с
 * целью включения их в конструкцию (проект) изделия;<BR>
 * h) данные, необходимые для контроля за ходом проекта;<BR>
 * i) данные, необходимые для контроля за утверждением проекта, отдельных аспектов проекта
 * или управления конфигурацией изделия;<BR>
 * j) данные, указывающие поставщика изделия или его проекта и, при необходимости,
 * определенную информацию о поставщике;<BR>
 * k) обозначение контракта и ссылка на него, если деталь разрабатывается согласно контракту;
 * l) обозначение уровня классификации защиты (конфиденциальности) отдельной детали или
 * детали, являющейся компонентом сборочной единицы;<BR>
 * m) данные, применяемые при анализе проекта, или результаты его проверки, используемые
 * для обоснования изменений, вносимых в проект.
 *
 * Область применения настоящего стандарта не охватывает:<BR>
 * a) данные, применяемые при анализе проекта, или результаты его проверки, не используемые
 * для обоснования изменений, вносимых в проект;<BR>
 * b) данные об изменениях в проекте по результатам исходного анализа до окончания данного
 * проекта;<BR>
 * c) данные, определяющие изделие и управление его конфигурацией, относящиеся к любым
 * стадиям жизненного цикла создания изделия помимо его проектирования;<BR>
 * d) коммерческие данные для управления проектированием конструкции;<BR>
 * e) альтернативные представления данных по различным правилам (дисциплинам), кроме
 * стадии проектирования (например, на стадии производства);<BR>
 * f) использование трехмерной булевой геометрии для представления предметов проектирования;<BR>
 * g) данные, относящиеся к визуальному представлению любой формы изделия или управлению
 * его конфигурацией.<BR>
 *
 * \section p203_s2 2 Нормативные ссылки
 *
 * В настоящем стандарте использованы нормативные ссылки на следующие стандарты:<BR>
 * ГОСТ Р ИСО/МЭК 8824-1--2001 Информационная технология. Абстрактная синтаксическая
 * нотация версии один (АСН.1). Часть 1. Спецификация основной нотации<BR>
 * \ref p1 "ГОСТ Р ИСО 10303-1-99" Системы автоматизации производства и их интеграция.
 * Представление данных об изделии и обмен этими данными. Часть 1. Общие представления и
 * основополагающие принципы<BR>
 * \ref p11 "ГОСТ Р ИСО 10303-11-2000" Системы автоматизации производства и их интеграция.
 * Представление данных об изделии и обмен этими данными. Часть 11. Методы описания. Справочное
 * руководство по языку EXPRESS<BR>
 * \ref p21 "ГОСТ Р ИСО 10303-21-2002" Системы автоматизации производства и их интеграция.
 * Представление данных об изделии и обмен этими данными. Часть 21. Методы реализации. Кодирование
 * открытым текстом структуры обмена<BR>
 * ГОСТ Р ИСО 10303-31--2002 Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 31. Методология и основы аттестаци­
 * онного тестирования. Общие положения<BR>
 * \ref p41 "ГОСТ Р ИСО 10303-41--99 Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 41. Интегрированные обобщенные ресурсы.
 * Основы описания и поддержки изделий"<BR>
 * ГОСТ Р ИСО 10303-43--2002 Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 43. Интегрированные обобщенные
 * ресурсы. Структуры представлений<BR>
 * ГОСТ Р ИСО 10303-44--2002 Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 44. Интегрированные обобщённые
 * ресурсы. Конфигурация структуры изделия<BR>
 * ИСО 31--92\f$^{*}\f$ Физические величины и единицы их измерения<BR>
 * ИСО 1000--92\f$^{*}\f$ Единицы измерения физических величин в системе Си и рекомендации по
 * применению единиц, кратных им, и некоторых других единиц<BR>
 * ИСО 10303-42--94\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 42. Интегрированные обобщенные ресурсы.
 * Геометрическое и топологическое представления<BR>
 * ИСО 10303-501--2000\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 501. Прикладная интерпретированная конструк­
 * ция. Плоский контур<BR>
 * ИСО 10303-502--2000\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 502. Прикладная интерпретированная конструкция.
 * Объемный контур<BR>
 * ИСО 10303-507--2001\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 507. Прикладная интерпретированная конструкция.
 * Геометрически ограниченная поверхность<BR>
 * ИСО 10303-509--2001\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 509. Прикладная интерпретированная конструкция.
 * Копируемая поверхность<BR>
 * ИСО 10303-510--2000\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 510. Прикладная интерпретированная конструкция.
 * Геометрически ограниченный контур<BR>
 * ИСО 10303-511--2001\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 511. Прикладная интерпретированная конструкция.
 * Топологически ограниченный контур<BR>
 * ИСО 10303-512--99\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 512. Прикладная интерпретированная конструкция.
 * Представление многогранного контура<BR>
 * ИСО 10303-514--99\f$^{*}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 514. Прикладная интерпретированная конструкция.
 * Представление сложной границы
 *
 * --------------------------
 * \f$^{*}\f$ Оригинал международного стандарта ИСО --- во ВНИИКИ Госстандарта России.
 *
 * \section p203_s3 3 Определения и сокращения
 *
 * \subsection p203_s3_1 Термины, определенные в ГОСТ Р ИСО 10303-1
 *
 * В настоящем стандарте использованы следующие термины:
 * - <B>комплект стандартных тестов;</B>
 * - <B>приложение;</B>
 * - <B>прикладная функциональная модель;</B>
 * - <B>прикладной контекст;</B>
 * - <B>прикладная интерпретированная модель;</B>
 * - <B>прикладной предмет (объект);</B>
 * - <B>прикладной протокол;</B>
 * - <B>прикладная эталонная модель;</B>
 * - <B>сборочная единица (узел);</B>
 * - <B>комплектующее (компонент);</B>
 * - <B>класс соответствия;</B>
 * - <B>требование соответствия;</B>
 * - <B>данные;</B>
 * - <B>обмен данными;</B>
 * - <B>метод реализации;</B>
 * - <B>информация;</B>
 * - <B>интегрированный ресурс;</B>
 * - <B>интерпретация;</B>
 * - <B>форма ЗСРП;</B>
 * - <B>изделие;</B>
 * - <B>данные об изделии;</B>
 * - <B>заявка о соответствии реализации протоколу (ЗСРП);</B>
 * - <B>структура;</B>
 * - <B>функциональная единица.</B>
 *
 * \subsection p203_s3_2 3.2 Термины, определенные в ГОСТ Р ИСО 10303-31
 * В настоящем стандарте использованы следующие термины:
 * - <B>аттестационное тестирование;</B>
 * - <B>препроцессор;</B>
 * - <B>постпроцессор.</B>
 * 
 * \subsection p203_s3_3 3.3 Термины, определенные в ГОСТ Р ИСО 10303-42
 * В настоящем стандарте использованы следующие термины:
 * - <B>дугообразное соединение;</B>
 * - <B>ось симметрии;</B>
 * - <B>ограничения;</B>
 * - <B>граница;</B>
 * - <B>трехмерная модель с граничным представлением;</B>
 * - <B>замкнутая кривая;</B>
 * - <B>замкнутая поверхность;</B>
 * - <B>соединение;</B>
 * - <B>соединенный компонент;</B>
 * - <B>кривая;</B>
 * - <B>цикл;</B>
 * - <B>размерность;</B>
 * - <B>область значений;</B>
 * - <B>пространство (оболочка);</B>
 * - <B>конечный;</B>
 * - <B>геометрическая система координат;</B>
 * - <B>граф;</B>
 * - <B>манипулятор;</B>
 * - <B>гомоморфный;</B>
 * - <B>список;</B>
 * - <B>ограниченное <I>d</I>-мерное пространство;</B>
 * - <B>незамкнутая кривая;</B>
 * - <B>незамкнутая поверхность;</B>
 * - <B>ориентированный;</B>
 * - <B>перекрытие;</B>
 * - <B>диапазон параметров;</B>
 * - <B>пространство параметров;</B>
 * - <B>координатная система размещения;</B>
 * - <B>самопересекающийся;</B>
 * - <B>самозацикленный;</B>
 * - <B>множество;</B>
 * - <B>размерность пространства;</B>
 * - <B>поверхность;</B>
 * - <B>топологический смысл.</B>
 *
 * \subsection p203_s3_4 3.4 Термины, определенные в ГОСТ Р ИСО 10303-43
 *
 * В настоящем стандарте использованы следующие термины:
 * - <B>координатное пространство;</B>
 * - <B>геометрически ограниченный;</B>
 * - <B>геометрически связанный.</B>
 *
 * \subsection p203_s3_5  3.5 Термины, определенные в ГОСТ Р ИСО 10303-44
 *
 * В настоящем стандарте использованы следующие термины:
 * - <B>узел-предок;</B>
 * - <B>структура спецификации;</B>
 * - <B>подчиненный узел;</B>
 * - <B>ориентированный ациклический граф;</B>
 * - <B>узел-потомок;</B>
 * - <B>форма, монтаж и функциональное назначение (изделия);</B>
 * - <B>краевой узел;</B>
 * - <B>связь;</B>
 * - <B>партия;</B>
 * - <B>узел (вершина);</B>
 * - <B>узел-родитель;</B>
 * - <B>структура списка частей (деталей);</B>
 * - <B>целевое назначение;</B>
 * - <B>корневой узел (вершина).</B>
 *
 * \subsection p203_s3_6 3.6 Другие определения
 *
 * В настоящем стандарте использованы следующие термины с соответствующими определениями:<BR>
 * 3.6.1 <B>стадия проектирования</B> (design phase): Период, в течение которого изменяют техническое
 * представление изделия.<BR>
 * 3.6.2 <B>механическая деталь</B> (mechanical part): Физический объект заданной формы, изготовлен­
 * ный из соответствующего материала.<BR>
 * 3.6.3 <B>трехмерная модель</B> (solid model): Трехмерный объект, внутреннее и внешнее описания
 * которого разделены двумерной границей.<BR>
 * 3.6.4 <B>подузел</B> (sub-assembly): Составная часть сборочной единицы, рассматриваемая как единое
 * целое.<BR>
 * 3.6.5 <B>каркасная модель</B> (wireframe model): Модель, описанная точками, отрезками и кривыми,
 * контуры которой образуют определенную форму.<BR>
 *
 * \subsection p203_s3_7 3.7 Сокращения
 *
 * В настоящем стандарте использованы следующие сокращения:<BR>
 * ПФМ (ААМ) --- прикладная функциональная модель;<BR>
 * ПИМ (AIM) --- прикладная интерпретированная модель;<BR>
 * ПП (АР) --- прикладной протокол;<BR>
 * ПЭМ (ARM) --- прикладная эталонная модель;<BR>
 * СП (ВОМ) --- спецификация (перечень изделий и материалов);<BR>
 * САПР (CAD) --- система автоматизированного проектирования;<BR>
 * УК (СМ) --- управление конфигурацией;<BR>
 * ОАГ (DAG) --- ориентированный ациклический граф;<BR>
 * ИАП (IСАМ) --- интегрированное автоматизированное производство;<BR>
 * ОБ (ID) --- обозначение (идентификация);<BR>
 * IDEF0 --- язык описания ИАП уровня 0;<BR>
 * IDEF1X --- язык описания ИАП уровня 1 --- расширенный;<BR>
 * ЗСРП (PICS) --- заявка о соответствии реализации протоколу;<BR>
 * ФЕ (UoF) --- функциональная единица.<BR>
 *
 * \section p203_s4 4 Информационные требования
 *
 *
 *
 *
\latexonly
\setlength{\parindent}{0mm} 
\endlatexonly
 * \}
 */
#endif /* _10303_203_DOC_H */
