/**
 * \file
 * \brief Файл с описанием общих принципов представления данных об изделии и обмене
 * данными (ГОСТ Р ИСО 10303-1-1999).
 */

#ifndef _10303_1_DOC_H
#define _10303_1_DOC_H

/**
 * \defgroup standard_001 Стандарт 10303-1
 * \{
 * \htmlonly
 * <script type="text/javascript">
 * window.onload = addIndent;
 * </script>
 * \endhtmlonly
 * \latexonly
 * \setlength{\parindent}{9.5mm} 
 * \endlatexonly
 * <HR>
 * \anchor p1
 * <CENTER>
 * \image html GOST.png
 * \image latex GOST.png width=1.5cm
 * </CENTER>
 * <CENTER><B>ГОСТ Р ИСО 10303-1-1999</B></CENTER>
 * <HR>
 * <H2>
 * <BR>Системы автоматизации производства и их интеграция ---<BR>
 * ПРЕДСТАВЛЕНИЕ ДАННЫХ ОБ ИЗДЕЛИИ И ОБМЕН ЭТИМИ ДАННЫМИ ---<BR>
 * Ч&nbsp;а&nbsp;с&nbsp;т&nbsp;ь 1.<BR>
 * Общие представления<BR>
 * и основополагающие принципы
 * </H2>
 *
 * \section p1_foreword Введение
 *
 * Информация об изделии, формируемая при его проектировании, производстве, эксплуатации,
 * техническом обслуживании и утилизации, используется для решения различных задач в течение
 * жизненного цикла изделия. Данная информация может быть использована во многих вычислительных
 * системах, включая системы, расположенные в различных организациях. Для обеспечения этого
 * организациям необходимо иметь возможность представлять информацию о своём изделии в едином
 * машинно-ориентированном формате, от которого требуется сохранение полноты и совместимости
 * информации при обмене между различными вычислительными системами.
 *
 * Стандарты серии ГОСТ Р ИСО 10303 распространяются на машинно-ориентированное представление
 * данных об изделии и обмен этими данными. Целью является создание механизма,
 * позволяющего описывать данные об изделии на протяжении всего жизненного цикла изделия
 * независимо от конкретной системы. Характер такого описания делает его пригодным не только для
 * обмена инвариантными файлами, но также и для создания баз данных об изделиях, коллективного
 * пользования этими базами и архивации соответствующих данных.
 *
 * Стандарты серии ГОСТ Р ИСО 10303 представляют собой набор отдельно издаваемых стандартов
 * (частей). Части данной серии стандартов относятся к одной из следующих тематических
 * групп: методы описания, интегрированные ресурсы, прикладные протоколы, комплекты абстрактных
 * тестов, методы реализации и аттестационное тестирование.
 *
 * Настоящий стандарт входит в серию ГОСТ Р ИСО 10303 и содержит общие представления о
 * стандартах данной серии. В настоящем стандарте определены функции различных групп частей
 * серии ГОСТ Р ИСО 10303 и взаимосвязи между ними.
 *
 * <SMALL>П&nbsp;р&nbsp;и&nbsp;м&nbsp;е&nbsp;ч&nbsp;а&nbsp;н&nbsp;и&nbsp;я<BR>
 * 1 Идентификатор информационного объекта, присвоенный настоящему стандарту,
 * описан в \ref p1_annex_a "приложении A".<BR>
 * 2 Список дополнительных публикаций, связанных с настоящим стандартом,
 * приведён в \ref p1_annex_b "приложении B".</SMALL>
 *
 * \section p1_s1 1 Область применения
 *
 * Настоящий стандарт содержит общие представления о стандартах серии ГОСТ Р ИСО 10303.
 *
 * Стандарты серии ГОСТ Р ИСО 10303 устанавливают форму представления информации об
 * изделии вместе с необходимыми механизмами и определениями, которые обеспечивают обмен
 * данными об изделии. Обмен производится между различными вычислительными системами и
 * средами, связанными с полным жизненным циклом изделия, включая его проектирование,
 * производство, эксплуатацию, обслуживание и окончательную утилизацию.
 *
 * Стандарты серии ГОСТ Р ИСО 10303 определяют:
 * - общее описание стандартов серии ГОСТ Р ИСО 10303;
 * - описание структуры стандартов серии ГОСТ Р ИСО 10303;
 * - определение терминов, используемых в стандартах серии ГОСТ Р ИСО 10303;
 * - общее описание методов определения данных, используемых в стандартах серии ГОСТ Р ИСО
 * 10303, включая язык описания данных EXPRESS и графическое представление моделей информации
 * об изделии;
 * - введение в интегрированные ресурсы;
 * - введение в прикладные протоколы, которые используются для определения области
 * применения, контекста и информационных требований приложения, а также представление прикладной
 * информации;
 * - введение в методологию и основы аттестационного тестирования, предназначенного для
 * оценки соответствия реализации стандартам серии ГОСТ Р ИСО 10303;
 * - введение в комплекты абстрактных текстов, используемые в качестве основы аттестационного
 * тестирования;
 * - введение в методы реализации, которые могут быть использованы в стандартах серии ГОСТ
 * Р ИСО 10303.
 *
 * Области применения остальных частей серии ГОСТ Р ИСО 10303 определены в соответствующих
 * стандартах этой серии.
 *
 * \section p1_s2 2 Нормативные ссылки
 *
 * В настоящем стандарте использованы ссылки на следующие стандарты:<BR>
 * \ref p21 "ГОСТ Р ИСО 10303-21-99" Системы автоматизации производства и их интеграция.
 * Представление данных об изделии и обмен этими данными. Часть 21. Методы реализации.
 * Кодирование открытым текстом структуры обмена<BR>
 * ГОСТ Р ИСО 10303-41--99 Системы автоматизации производства и их интеграция.
 * Представление данных об изделии и обмен этими данными. Часть 41.
 * Интегрированные обобщённые ресурсы. Основы описания и поддержки изделий<BR>
 * ИСО/МЭК 8824-1--95\f$^{1}\f$ Информационная технология. Взаимосвязь открытых систем.
 * Абстрактная синтаксическая нотация версии один (АСН.1). Часть 1. Требования к основной нотации<BR>
 * \ref p11 "ИСО 10303-11--94"\f$^{1}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 11. Справочное руководство по языку EXPRESS<BR>
 * ИСО 10303-31--94\f$^{1}\f$ Системы автоматизации производства и их интеграция. Представление
 * данных об изделии и обмен этими данными. Часть 31. Методология и основы аттестационного
 * тестирования. Общие положения
 *
 * --------------------------
 * \f$^{1}\f$ Международные стандарты ИСО (ИСО/МЭК) --- во ВНИИКИ Госстандарта России.
 *
 * \section p1_s3 3 Определения и сокращения
 *
 * \subsection p1_s3_1 Термины, определённые в ИСО 10303-31
 *
 * В настоящем стандарте использованы следующие термины, определённые в ИСО 10303-31:
 * - абстрактный тестовый пример;
 * - абстрактный метод тестирования;
 * - аттестационное тестирование;
 * - вердикт;
 * - критерий вердикта;
 * - цель тестирования.
 *
 * \subsection p1_s3_2 3.2 Другие определения
 *
 * В настоящем стандарте использованы следующие термины с соответствующими определениями:<BR>
 * \anchor p1_s3_2_1
 * 3.2.1 <B>комплект абстрактных тестов</B> (abstract test suite): Часть настоящей серии стандартов,
 * которая содержит множество абстрактных тестовых примеров, необходимых для аттестационного
 * тестирования реализации прикладного протокола;<BR>
 * \anchor p1_s3_2_2
 * 3.2.2 <B>приложение</B> (application): Группа, состоящая из одного или нескольких процессов,
 * формирующих или использующих данные об изделии;<BR>
 * \anchor p1_s3_2_3
 * 3.2.3 <B>прикладная функциональная модель (ПФМ)</B> [application activity model (ААМ)]: Модель,
 * описывающая приложение в терминах процессов и информационных потоков приложения;<BR>
 * \anchor p1_s3_2_4
 * 3.2.4 <B>прикладной контекст</B> (application context): Среда, в которой интерпретируются
 * интегрированные ресурсы для обеспечения использования данных об изделии в конкретном приложении;<BR>
 * \anchor p1_s3_2_5
 * 3.2.5 <B>прикладная интерпретированная модель (ПИМ)</B> [application interpreted model (AIM)]:
 * Информационная модель, в которой используются интегрированные ресурсы, необходимые для
 * удовлетворения информационных потребностей и соблюдения информационных ограничений
 * прикладной эталонной модели в рамках прикладного протокола;<BR>
 * \anchor p1_s3_2_6
 * 3.2.6 <B>прикладной объект</B> (application object): Элементарный компонент прикладной эталонной
 * модели, который определяет уникальное понятие приложения и содержит атрибуты, определяющие
 * элементы данных объекта;<BR>
 * \anchor p1_s3_2_7
 * 3.2.7 <B>прикладной протокол (ПП)</B> [application protocol (АР)]: Часть настоящей серии стандартов,
 * которая определяет прикладную интерпретированную модель, удовлетворяющую области применения
 * и информационным требованиям к конкретному приложению \ref p1_b1 "[1]".
 *
 * <SMALL>П&nbsp;р&nbsp;и&nbsp;м&nbsp;е&nbsp;ч&nbsp;а&nbsp;н&nbsp;и&nbsp;е ---
 * Данное определение отличается от определения, используемого в стандартах взаимосвязи
 * открытых систем (ВОС). Однако пока настоящая серия стандартов не предназначена для
 * непосредственного использования при организации ВОС, противоречий не возникнет;</SMALL>
 *
 * \anchor p1_s3_2_8
 * 3.2.8 <B>прикладная эталонная модель (ПЭМ)</B> [application reference model (ARM)]:
 * Информационная модель, которая описывает информационные требования и ограничения
 * конкретного прикладного контекста;<BR>
 * \anchor p1_s3_2_9
 * 3.2.9 <B>прикладной ресурс</B> (application resource): Интегрированный ресурс,
 * содержимое которого связано с группой прикладных контекстов;<BR>
 * \anchor p1_s3_2_10
 * 3.2.10 <B>сборочная единица</B> (assembly): Изделие, которое разлагаемо на множество
 * комплектующих или других сборочных единиц с точки зрения конкретного приложения
 * предметной области;<BR>
 * \anchor p1_s3_2_11
 * 3.2.11 <B>комплектующее (изделие)</B> (component): Изделие, которое не разлагаемо с точки зрения
 * конкретного приложения;<BR>
 * \anchor p1_s3_2_12
 * 3.2.12 <B>класс соответствия</B> (conformance class): Подмножество прикладного протокола,
 * соответствие которому может быть заявлено;<BR>
 * \anchor p1_s3_2_13
 * 3.2.13 <B>требование соответствия</B> (conformance requirement): Точное текстовое определение
 * характеристики, которой должна обладать соответствующая реализация;<BR>
 * \anchor p1_s3_2_14
 * 3.2.14 <B>данные</B> (data): Представление информации в формальном виде, пригодном для передачи,
 * интерпретации или обработки людьми или компьютерами;<BR>
 * \anchor p1_s3_2_15
 * 3.2.15 <B>обмен данными</B> (data exchange): Хранение, доступ, передача и архивирование данных;<BR>
 * \anchor p1_s3_2_16
 * 3.2.16 <B>язык определения данных</B> (data specification language): Набор правил для определения
 * данных и их взаимосвязей, пригодный для компьютерной передачи, интерпретации или обработки;<BR>
 * \anchor p1_s3_2_17
 * 3.2.17 <B>структура обмена</B> (exchange structure): Машинно-ориентированный формат, используемый
 * для хранения, доступа, передачи и архивирования данных;<BR>
 * \anchor p1_s3_2_18
 * 3.2.18 <B>обобщённый ресурс</B> (generic resource): Интегрированный ресурс, содержимое которого
 * не зависит от контекста;<BR>
 * \anchor p1_s3_2_19
 * 3.2.19 <B>метод реализации</B> (implementation method): Часть настоящей серии стандартов, которая
 * определяет способ, используемый компьютерными системами для обмена данными об изделии,
 * описанными с помощью языка определения данных EXPRESS;<BR>
 * \anchor p1_s3_2_20
 * 3.2.20 <B>информация</B> (information): Факты, понятия или инструкции;<BR>
 * \anchor p1_s3_2_21
 * 3.2.21 <B>информационная модель</B> (information model): Формальная модель ограниченного набора
 * фактов, понятий или инструкций, предназначенная для удовлетворения конкретному требованию;<BR>
 * \anchor p1_s3_2_22
 * 3.2.22 <B>интегрированный ресурс</B> (integrated resource): Часть настоящей серии стандартов, которая
 * определяет группу структур ресурсов, используемых в качестве основы для определения данных об
 * изделии;<BR>
 * \anchor p1_s3_2_23
 * 3.2.23 <B>интерпретация</B> (interpretation): Процесс адаптации структуры ресурса из интегрированных
 * ресурсов для удовлетворения требованию прикладного протокола. Данный процесс может
 * охватывать: дополнительные ограничения на атрибуты, дополнительные условия, дополнительные
 * взаимосвязи между структурами ресурсов и прикладными структурами или все вышеперечисленное;<BR>
 * \anchor p1_s3_2_24
 * 3.2.24 <B>форма ЗСРП</B> (PICS proforma): Стандартизованный документ в виде вопросника, который,
 * при его заполнении для конкретной реализации, становится заявкой о соответствии реализации
 * протоколу;<BR>
 * \anchor p1_s3_2_25
 * 3.2.25 <B>представление</B> (presentation): Визуально распознаваемое представление данных об
 * изделии;<BR>
 * \anchor p1_s3_2_26
 * 3.2.26 <B>изделие</B> (product): Объект или вещество, полученные естественным или искусственным
 * путём;<BR>
 * \anchor p1_s3_2_27
 * 3.2.27 <B>данные об изделии</B> (product data): Представление информации об изделии в формальном
 * виде, пригодном для её передачи, интерпретации или обработки людьми или компьютерами;<BR>
 * \anchor p1_s3_2_28
 * 3.2.28 <B>информация об изделии</B> (product information): Факты, понятия или инструкции об
 * изделии;<BR>
 * \anchor p1_s3_2_29
 * 3.2.29 <B>информационная модель изделия</B> (product information model): Информационная модель,
 * которая содержит абстрактное описание фактов, понятий и инструкций об изделии;<BR>
 * \anchor p1_s3_2_30
 * 3.2.30 <B>заявка о соответствии реализации протоколу (ЗСРП)</B> [(protocol implementation
 * conformance statement (PICS)]: Заявка о том, какие возможности и варианты из настоящей серии
 * стандартов поддерживаются в рамках реализации. Данная заявка создаётся путём заполнения формы ЗСРП;<BR>
 * \anchor p1_s3_2_31
 * 3.2.31 <B>структура ресурса</B> (resource construct): Набор объектов, типов, функций,
 * правил и ссылок на языке EXPRESS, которые вместе составляют достоверное описание аспекта
 * данных об изделии;<BR>
 * \anchor p1_s3_2_32
 * 3.2.32 <B>структура</B> (structure): Набор взаимосвязанных частей какого-либо сложного объекта,
 * а также взаимосвязей между ними;<BR>
 * \anchor p1_s3_2_33
 * 3.2.33 <B>функциональная единица</B> (unit of functionality): Набор прикладных объектов и отношений
 * между ними, которые определяют одно или несколько понятий в рамках прикладного
 * контекста таким образом, что отсутствие любого компонента сделает понятия неполными или неоднозначными.
 *
 * \subsection p1_s3_3 3.3 Сокращения
 *
 * В настоящем стандарте использованы следующие обозначения и сокращения:<BR>
 * <B>ПФМ</B> (AAM) --- прикладная функциональная модель;<BR>
 * <B>ПИМ</B> (AIM) --- прикладная интерпретированная модель;<BR>
 * <B>ПП</B> (AP)--- прикладной протокол;<BR>
 * <B>ПЭМ</B> (ARM) --- прикладная эталонная модель;<BR>
 * <B>ЗСРП</B> (PICS) --- заявка о соответствии реализации протоколу.
 *
 * \section p1_s4 4 Обзор серии ГОСТ Р ИСО 10303
 *
 * \subsection p1_s4_1 4.1 Цель
 *
 * Целью стандартов серии ГОСТ Р ИСО 10303 является определение формы для однозначного
 * представления машинно-ориентированных данных об изделии и обмена этими данными в течение
 * всей жизни изделия. Данная форма должна быть независимой от любой конкретной вычислительной
 * системы. Данная форма позволяет обеспечить согласованность реализаций между множеством
 * приложений и систем. Стандарты серии ГОСТ Р ИСО 10303 разрешают использование различных
 * методов реализации, применяемых для хранения, доступа, передачи и архивирования данных об
 * изделии. Данные реализации могут быть протестированы на соответствие.
 *
 * \subsection p1_s4_2 4.2 Основополагающие принципы
 *
 * В стандартах серии ГОСТ Р ИСО 10303 способы представления информации об изделии
 * отделяются от способов реализации, используемых для обмена данными.
 *
 * Способы представления обеспечивают единое представление информации об изделии, общее
 * для многих приложений. Данное единое представление может быть адаптировано для удовлетворения
 * потребностей конкретного приложения. Прикладной протокол определяет представление информации
 * об изделии для одного или нескольких приложений.
 *
 * В стандартах серии ГОСТ Р ИСО 10303 установлены способы реализации, которые обеспечивают
 * обмен данными об изделии, определёнными в прикладных протоколах.
 *
 * В стандартах серии ГОСТ Р ИСО 10303 описан формальный язык определения данных
 * EXPRESS, который используется для описания представления информации об изделии. Использование
 * формального языка обеспечивает однозначность и согласованность представления, а также
 * упрощает разработку реализаций.
 *
 * В стандартах серии ГОСТ Р ИСО 10303 определены методология и основы аттестационного
 * тестирования реализаций.
 *
 * \subsubsection p1_s4_2_1 4.2.1 Интегрированные ресурсы
 *
 * Технические требования (спецификация) представления информации об изделии
 * обеспечиваются набором интегрированных ресурсов. Каждый интегрированный ресурс состоит из набора
 * описаний данных об изделии на языке EXPRESS, называемых структурами ресурсов. При описании
 * один набор может зависеть от других наборов. Сходная информация для различных приложений
 * представляется единой структурой ресурса.
 *
 * Интегрированные ресурсы разделены на две группы: обобщённые ресурсы и прикладные
 * ресурсы. Обобщённые ресурсы не зависят от приложений и могут содержать ссылки друг на друга.
 * Прикладные ресурсы могут ссылаться на обобщённые ресурсы и расширять другие структуры
 * ресурсов для использования группой однородных приложений. Прикладные ресурсы не ссылаются
 * на другие прикладные ресурсы.
 *
 * \subsubsection p1_s4_2_2 4.2.2 Поддержка приложений
 *
 * Интегрированные ресурсы определяют обобщённую информационную модель для информации
 * об изделии. Их недостаточно для удовлетворения информационных требований приложений
 * без дополнения конкретными прикладными ограничениями, взаимосвязями и атрибутами.
 *
 * Стандарты серии ГОСТ Р ИСО 10303 определяют прикладные протоколы, в которых интегрированные
 * ресурсы интерпретируются для удовлетворения требованиям к информации об изделии
 * со стороны конкретных приложений. Интерпретация (настройка) производится путём выбора
 * соответствующих структур ресурсов и уточнения их значения, установления любых соответствующих
 * ограничений, взаимоотношений и атрибутов. Результатом данного процесса является прикладная
 * интерпретированная модель. Прикладная интерпретированная модель документируется как часть
 * прикладного протокола.
 *
 * Если структура ресурса используется для представления одинакового информационного требования
 * в различных прикладных протоколах, то должна быть применена одна и та же интерпретация
 * структуры ресурса. Область применения и информационные требования приложения устанавливаются
 * в терминологии приложения. Прикладной протокол определяет отображение, показывающее,
 * как используется интерпретация интегрированных ресурсов для удовлетворения информационным
 * требованиям приложения.
 *
 * \subsubsection p1_s4_2_3 4.2.3 Методы реализации
 *
 * Каждый метод реализации, описанный в стандартах серии ГОСТ Р ИСО 10303, устанавливается
 * путём отображения с языка EXPRESS на формальный язык, используемый для данного метода.
 * Отображение независимо от прикладного протокола. Отображение выражается в формальной нотации.
 * В стандартах серии ГОСТ Р ИСО 10303 определены по крайней мере три метода реализации.
 *
 * \subsubsection p1_s4_2_4 4.2.4 Реализации
 *
 * Прикладной протокол может устанавливать один или несколько прикладных методов реализации
 * из набора методов реализации, описанных в стандартах серии ГОСТ Р ИСО 10303. Реализация
 * должна применять к прикладной интерпретированной модели приложения один или несколько
 * методов реализации, установленных в прикладном протоколе.
 *
 * \subsubsection p1_s4_2_5 4.2.5 Аттестационное тестирование
 *
 * Соответствие реализации прикладному протоколу устанавливается требованиями к соответствию,
 * заданными в прикладном протоколе.
 *
 * Набор тестов, устанавливаемых в комплекте абстрактных тестов, определён для каждого
 * прикладного протокола. При переходе к методу абстрактного тестирования данные тесты могут быть
 * использованы для оценки соответствия реализации. Общие основы оценки соответствия
 * установлены ИСО 10303-31.
 *
 * Метод абстрактного тестирования для каждого метода реализации установлен в одной из групп
 * основ и методологий аттестационного тестирования, описанных в стандартах серии ГОСТ Р ИСО 10303.
 *
 * Область применения аттестационного тестирования конкретной реализации состоит из требований,
 * установленных для класса(ов) соответствия, заявленного для реализации в заявке на соответствие
 * реализации протоколу. Тесты, выбранные из комплекта абстрактных тестов, базируются на
 * классе соответствия, заявленном реализацией. Результаты тестирования создают основу для оценки
 * соответствия.
 *
 * Стандарты серии ГОСТ Р ИСО 10303 содержат описания комплектов абстрактных тестов и
 * определяют методы абстрактного тестирования для проведения аттестационного тестирования,
 * обеспечивающего основу для получения воспроизводимых, сравнимых и контролируемых результатов
 * тестирования. Включение в стандарты серии ГОСТ Р ИСО 10303 процедур аттестационного
 * тестирования способствует широкому распространению результатов тестирования.
 *
 * \subsection p1_s4_3 4.3 Регистрация информационного объекта
 *
 * Для обеспечения однозначной идентификации схем и других информационных объектов в
 * открытой информационной системе в настоящем стандарте используется метод регистрации,
 * определённый в ИСО/МЭК 8824-1. Данный метод обозначает объекты по их расположению в
 * древовидной структуре, принятой в ИСО. Каждый узел «дерева» обозначен последовательностью целых чисел,
 * соответствующей индексу листа под каждым узлом. Узлы обозначают организации, которые в свою
 * очередь могут определять нижележащие узлы, называемые полномочиями по регистрации. Все это
 * предусмотрено в данном методе для обеспечения регистрации, проводимой национальными
 * органами и другими организациями (включая частные фирмы). Полномочие по регистрации
 * автоматически присваивается техническому комитету или подкомитету, который подготовил стандарт, для
 * того чтобы идентифицировать объекты в стандарте. Таким образом, стандарты серии ИСО 10303
 * обозначаются идентификатором объекта вида:
 * <CENTER>{ 1 0 10303 }</CENTER>
 * Здесь первоначальная 1 обозначает ИСО; последующий 0 обозначает объект как стандарт, а
 * последующий номер соответствует номеру стандарта. ИСО/МЭК 8824-1 также определяет идентификаторы
 * для подстановки вместо соответствующих номеров; так, «исо» имеет значение 1, а
 * «стандарт» имеет значение 0. Для многочастевых стандартов требуется дополнительный номер для
 * указания номера части. Таким образом, часть 1 стандарта ИСО 10303 обозначается следующим
 * идентификатором объекта:
 * <CENTER>{ iso standard 10303 part(1) }</CENTER>
 * В данном примере номер части указан полностью, но нотация позволяет связать термин с его
 * значением посредством некоторой семантики. Нотация для значений данного типа определена в
 * разделе 28 ИСО/МЭК 8824-1, а предопределённые значения установлены в приложении В к
 * ИСО/МЭК 8824-1.
 *
 * В целях однозначной идентификации информационного объекта в открытой информационной
 * системе в стандартах серии ГОСТ Р ИСО 10303 приняты следующие соглашения:
 * - Значением, следующим за номером части, должен быть номер версии. Согласовано, что
 * значение номера версии для первой редакции должно быть равно 1. Значение 0 резервируется для
 * ссылок на проекты документов.
 * - Значение, следующее за номером версии, используется для обозначения типа информационного
 * объекта, определённого в данной части стандарта. Значение 1 указывает на то, что объект
 * идентифицирован в качестве схемы.
 * - Значение, следующее за типом объекта, является целым числом, которое определяет экзем­
 * пляр типа объекта, обозначенного соответствующим образом.
 * - Чтобы удовлетворить синтаксическим требованиям ИСО/МЭК 8824-1, в случаях наличия в
 * имени схемы символа «подчеркивание» вместо него при определении соответствующего значения
 * проставляется символ «дефис».
 *
 * <SMALL><B>Пример</B> --- В ГОСТ Р ИСО 10303-41 определены несколько схем. Схема_прикладного_контекста может
 * быть идентифицирована значением:
 * <CENTER>{iso standard 10303 part(41) version(1) object(1) application-context-schema(1) },</CENTER>
 * а схема_определения_изделия может быть идентифицирована значением:
 * <CENTER>{iso standard 10303 part(41) version(1) object(1) product-definition-schema(2) }</CENTER>
 * </SMALL>
 *
 * \section p1_s5 5 Структура стандартов серии ГОСТ Р ИСО 10303
 *
 * Серия стандартов ГОСТ Р ИСО 10303 делится на шесть групп частей. Каждая группа имеет
 * своё функциональное назначение. В каждую группу может входить одна или несколько частей. Ниже
 * приведён список групп с указанием схемы их нумерации:
 * - Методы описания --- части 11--19.
 * - Интегрированные ресурсы:
 * - Обобщённые ресурсы --- части 41--99.
 * - Прикладные ресурсы --- части 101--199.
 * - Прикладные протоколы --- части 201--1199.
 * - Методология и основы аттестационного тестирования --- части 31--39.
 * - Комплекты абстрактных тестов --- части 1201--2199, соответствующие связанным с ними
 * прикладным протоколам 201--1199.
 * - Методы реализации --- части 21--29.
 *
 * \section p1_s6 6 Методы описания
 *
 * Описание данных об изделии в интегрированных ресурсах и прикладных протоколах требует
 * использования формальных языков определения данных, чтобы обеспечить согласованность и
 * избежать неопределённости. Языки должны быть как удобными для восприятия человеком, так и
 * машинно-воспринимаемыми, чтобы облегчить создание прикладных программных средств и
 * инструментальных средств поддержки.
 *
 * \subsection p1_s6_1 6.1 Язык EXPRESS
 *
 * EXPRESS является формальным языком определения данных, описанным в \ref p11 "ИСО 10303-11",
 * который обеспечивает механизм стандартного описания данных об изделии как в интегрированных
 * ресурсах, так и в прикладных протоколах.
 *
 * EXPRESS позволяет описать данные и ограничения применительно к данным об изделии.
 * EXPRESS допускает определение структур ресурсов исходя из элементов данных, ограничений,
 * взаимосвязей, правил и функций. Язык позволяет классифицировать и структурировать структуры
 * ресурсов. Структуры ресурсов могут быть интерпретированы в рамках прикладных протоколов.
 * Возможности интерпретации EXPRESS являются механизмом для обеспечения разработки прикладных
 * протоколов, позволяя дополнять ограничения на атрибуты, устанавливать дополнительные
 * ограничения, дополнительные взаимосвязи между структурами ресурсов и прикладными структурами
 * или реализовывать все вышеперечисленные возможности.
 *
 * \subsection p1_s6_2 6.2 Графическое представление моделей
 *
 * Графические представления моделей, иллюстрирующие стандартные определения данных, во
 * всех случаях носят справочный характер. В стандартах серии ГОСТ Р ИСО 10303 существуют четыре
 * типа моделей, использующие графические представления:
 * - структуры ресурсов в рамках интегрированных ресурсов;
 * - прикладные функциональные модели;
 * - прикладные эталонные модели;
 * - прикладные интерпретированные модели.
 *
 * Графические представления служат для облегчения понимания определений, содержащихся в
 * каждой части стандарта. В стандартах серии ГОСТ Р ИСО 10303 используются различные графические
 * представления, включая:
 * - EXPRESS-G --- графическое представление языка EXPRESS, определённое в \ref p11_annex_d "приложении D"
 * к \ref p11 "ИСО 10303-11";
 * - IDEF0 --- нотация функционального моделирования \ref p1_b2 "[2]", используемая для прикладных
 * функциональных моделей в рамках прикладных протоколов;
 * - IDEF1X --- графическое представление, используемое в методе информационного
 * моделирования IDEF1X \ref p1_b3 "[3]";
 * - NIAM --- графическое представление, используемое в методе информационного
 * моделирования NIAM \ref p1_b4 "[4]".
 *
 * \section p1_s7 7 Интегрированные ресурсы
 *
 * Интегрированные ресурсы представляют структуры ресурсов, которые используются в качестве
 * основы представления данных об изделии. Для удовлетворения информационных требований
 * приложений проводят интерпретацию интегрированных ресурсов.
 *
 * Интегрированные ресурсы обеспечивают уникальные представления каждого элемента информации
 * в рамках стандартов серии ГОСТ Р ИСО 10303. Смысловые значения структур ресурсов
 * обеспечиваются посредством соответствующих текстовых определений.
 *
 * Интегрированные ресурсы подразделены на логически связанные наборы одной или нескольких
 * структур ресурсов. Обобщённые ресурсы независимы от контекста. Прикладные ресурсы могут
 * быть использованы в заданном диапазоне приложений.
 *
 * Примеры двух типов интегрированных ресурсов охватывают:
 *
 * <B>Обобщённые ресурсы:</B>
 * - основы описания и поддержки изделия (часть 41);
 * - геометрическое и топологическое представление (часть 42);
 * - представления структур (часть 43);
 * - конфигурация структуры изделия (часть 44);
 * - визуальное представление (часть 46).
 *
 * <B>Прикладные ресурсы:</B>
 * - черчение (часть 101).
 *
 * Для устранения возможности дублирования структуры обобщённых ресурсов могут быть
 * взаимозависимы. Структуры прикладных ресурсов могут ссылаться на структуры
 * обобщённых ресурсов. 
 *
 * \section p1_s8 8 Прикладные протоколы
 *
 * \subsection p1_s8_1 8.1 Определение прикладных требований
 *
 * Прикладной протокол (ПП) включает в себя определения области применения, контекста и
 * информационных требований приложения. Определения могут определять функции, процессы или
 * информацию, которые вынесены за рамки приложения для построения более чёткого описания
 * области применения, контекста и информационных требований. Описание области применения
 * поддерживается прикладной функциональной моделью (ПФМ), которая описывает процессы,
 * информационные потоки и функциональные требования приложения. ПФМ входит в прикладной
 * протокол в качестве информационного приложения.
 *
 * Информационные требования и ограничения прикладного контекста определяются с помощью
 * набора функциональных единиц и прикладных объектов с использованием
 * проблемно-ориентированной терминологии. Данное определение исходит из прикладной
 * эталонной модели (ПЭМ). ПЭМ является формальной информационной моделью, документируемой
 * в виде информационного приложения к прикладному протоколу.
 *
 * \subsection p1_s8_2 8.2 Информационное представление
 *
 * Структуры ресурсов для представления информационных требований приложения устанавливаются
 * в прикладной интерпретированной модели (ПИМ) с использованием языка EXPRESS. ПИМ
 * строится на основе структур ресурсов, определяемых интегрированными ресурсами. Структуры
 * ресурсов интерпретируются, чтобы удовлетворить прикладным требованиям в рамках определённого
 * контекста и области применения ПП.
 *
 * Строится отображение из информационных требований на ПИМ. Данное отображение определяет
 * применение в рамках ПИМ структур ресурсов, полученных из интегрированных ресурсов,
 * для представления информационных требований приложения.
 *
 * \subsection p1_s8_3 8.3 Методы реализации
 *
 * ПП не зависит от методов реализации. Однако ПП может включать в себя конкретную
 * информацию о методе реализации в качестве обязательного приложения. ПП содержит таблицу
 * сокращённых наименований, которая используется методом реализации структуры обмена для
 * кодирования имён объектов ПП.
 *
 * \subsection p1_s8_4 8.4 Требования соответствия
 *
 * В прикладной протокол включают требования соответствия, которым должна удовлетворять
 * любая реализация, претендующая на выполнение требований ПП. Требования соответствия
 * отражают возможности, установленные в ПП, и могут быть конкретизированы в методах описания,
 * методах реализации или в наборах прикладных протоколов, описанных в стандартах серии
 * ГОСТ Р ИСО 10303.
 *
 * \section p1_s9 9 Методология и основы аттестационного тестирования
 *
 * \subsection p1_s9_1 9.1 Цели аттестационного тестирования
 *
 * Группы основ и методологий аттестационного тестирования, описанные в стандартах серии
 * ГОСТ Р ИСО 10303, устанавливают общие методологию и требования к процессу тестирования
 * соответствия изделия, которое претендует на реализацию прикладного протокола по стандартам
 * серии ГОСТ Р ИСО 10303. Целью методологии и основ аттестационного тестирования является
 * обеспечение:<BR>
 * - воспроизводимости: согласованности результатов тестирования вне зависимости от условий
 * его проведения;
 * - сравнимости: согласованности результатов тестирования вне зависимости от места его
 * проведения;
 * - контролируемости: возможности подтвердить правильность процедур тестирования, после
 * проведения тестирования, на основании проверки соответствующего отчёта.
 *
 * В ИСО 10303-31 определены основы и описаны общие концепции аттестационного тестирования
 * реализаций стандартов серии ИСО 10303 (ГОСТ Р ИСО 10303).
 *
 * \subsection p1_s9_2 9.2 Процедуры аттестационного тестирования
 *
 * Аттестационное тестирование прикладного протокола может быть выполнено путём применения
 * метода абстрактного тестирования выбранного метода реализации к тестовым примерам из
 * комплекта абстрактных тестов. Процедуры аттестационного тестирования не зависят от тестируемой
 * реализации.
 *
 * Если в одной реализации сочетаются несколько прикладных протоколов, аттестационное
 * тестирование проводят отдельно для каждого прикладного протокола.
 *
 * Стандарты серии ГОСТ Р ИСО 10303 определяют роли и обязанности испытательных
 * лабораторий и клиентов, предоставляющих реализации для аттестационного тестирования.
 *
 * \subsection p1_s9_3 9.3 Методы абстрактного тестирования
 *
 * Стандарты серии ГОСТ Р ИСО 10303 устанавливают метод абстрактного тестирования для
 * каждого метода реализации. Метод абстрактного тестирования описывает порядок тестирования
 * реализации конкретного метода реализации вне зависимости от:<BR>
 * - конкретной реализации;
 * - средств и процедур тестирования;
 * - конкретного тестируемого прикладного протокола.
 *
 * \section p1_s10 10 Комплекты абстрактных тестов
 *
 * Комплект абстрактных тестов содержит набор абстрактных тестовых примеров для прикладного
 * протокола, обеспечивающих проверку требований соответствия. В каждом абстрактном тестовом
 * примере задаётся независимая от реализации последовательность действий, необходимых для оценки
 * части одного или нескольких требований соответствия. Каждый прикладной протокол содержит
 * нормативную ссылку на соответствующий комплект абстрактных тестов.
 *
 * Каждое требование соответствия связано с одним или несколькими абстрактными тестовыми
 * примерами, разработанными для реализации одной или нескольких целей тестирования. Для каждого
 * абстрактного тестового примера критерий вердикта выводят из требований соответствия, чтобы
 * позволить испытательной лаборатории оценить соответствие реализации, относящееся к данному
 * тестовому примеру. По выполнении аттестационного теста, основанного на абстрактном тестовом
 * примере, выносят окончательный вердикт, если реализация удовлетворяет одному или нескольким
 * требованиям соответствия.
 *
 * \section p1_s11 11 Методы реализации
 *
 * \subsection p1_s11_1 11.1 Цель
 *
 * Стандарты серии ГОСТ Р ИСО 10303 предназначены для различных методов реализации. Метод
 * реализации определяет конкретный способ использования прикладных протоколов, определённых
 * в стандартах серии ГОСТ Р ИСО 10303. В \ref p21 "ГОСТ Р ИСО 10303-21" установлен метод реализации для
 * структуры обмена. Структура обмена предназначена для записи и считывания описания данных об
 * изделии в прикладных протоколах с использованием кодирования открытым текстом или двоичного
 * кодирования.
 *
 * \subsection p1_s11_2 11.2 Использование формального языка
 *
 * Метод реализации определяет использование формального языка таким образом, чтобы при
 * создании реализаций могли быть применены машинно-зависимые методы.
 *
 * \subsection p1_s11_3 11.3 Отображение из языка EXPRESS на метод реализации
 *
 * EXPRESS обеспечивает основу всех определений информации об изделии в стандартах серии
 * ГОСТ Р ИСО 10303. Каждый метод реализации, определённый в стандартах серии ГОСТ Р ИСО 10303,
 * устанавливает правила отображения из синтаксиса EXPRESS на язык, используемый для метода
 * реализации. Структура и синтаксис каждой структуры ресурсов в том виде, в котором она
 * используется в реализации, формируется путём применения правил отображения. Правила,
 * применяемые для конкретного метода реализации, могут быть условно представлены в виде
 * описания на языке EXPRESS, которое будет отображаться. Любая схема, определённая на языке
 * EXPRESS, может быть отображена на метод реализации.
 *
 * \subsection p1_s11_4 11.4 Реализация структуры обмена
 *
 * Синтаксические правила и правила отображения для структуры обмена, использующей кодирование
 * открытым текстом, установлены \ref p21 "ГОСТ Р ИСО 10303-21". Структура обмена может быть
 * реализована для обеспечения файлового обмена. Язык, используемый для синтаксиса метода
 * реализации структуры обмена, основан на нотации синтаксиса по Вирту \ref p1_b5 "[5]".
 * Определено отображение из языка EXPRESS на синтаксис структуры обмена.
 *
 * \anchor p1_annex_a
 * <CENTER>ПРИЛОЖЕНИЕ А</CENTER>
 *
 * <CENTER>(обязательное)</CENTER><BR>
 * <CENTER><B>Регистрация информационного объекта</B></CENTER>
 *
 * Для того чтобы обеспечить однозначную идентификацию информационного объекта в открытой системе,
 * настоящему стандарту присвоен идентификатор объекта:
 *
 * <CENTER>{ iso standard 10303 part(1) version(1) }</CENTER>
 *
 * Смысл данного значения определён в соответствии с ИСО/МЭК 8824-1 и уточнён в \ref p1_s4_3 "4.3".
 *
 * \anchor p1_annex_b
 * <CENTER>ПРИЛОЖЕНИЕ B</CENTER>
 *
 * <CENTER>(справочное)</CENTER><BR>
 * <CENTER><B>Библиография</B></CENTER>
 *
 * \anchor p1_b1
 * [1] «Guidelines for Development and Approval of STEP Application Protocols, Version 1.1», TC 184/SC4/WG4
 * N66, January 1993<BR>
 * \anchor p1_b2
 * [2] «IDEFO (ICAM Definition Language 0)», Federal Information Processing Publication 183, Integration
 * Definition for Function Modeling (IDEFO), FIPS PUB 183, National Institute of Standards and Technology,
 * December 1993<BR>
 * \anchor p1_b3
 * [3] «IDEF1X (ICAM Definition Language 1 Extended)», Federal Information Processing Publication 184,
 * Integration Definition for Function Modeling (IDEF1X), FIPS PUB 184, National Institute of Standards and
 * Technology, December 1993<BR>
 * \anchor p1_b4
 * [4] NIJSSEN, G.M. and HALPLIN, T.A.; «Conceptual Schema and Relational Database Design: A Fact Oriented
 * Approach», Prentice Hall, New York, 1989<BR>
 * \anchor p1_b5
 * [5] WIRTH, N., «What can we do about the unnecessary diversity of notation for syntactic definitions?»,
 * Communications of the Association for Computing Machinery, Volume 20, Number 11, November 1977
 *
 * \anchor p1_index
 * <CENTER><B>Указатель основных использованных терминов</B></CENTER>
 *
 * <TABLE border="0">
 * <TR><TD>EXPRESS
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
 * </TD><TD>\ref p1_s4_2 "4.2";\ref p1_s6_1 "6.1";\ref p1_s11_3 "11.3"</TD></TR>
 * <TR><TD>EXPRESS-G</TD><TD>\ref p1_s6_2 "6.2"</TD></TR>
 * <TR><TD>аттестационное тестирование</TD><TD>\ref p1_s5 "5";\ref p1_s9_1 "9.1"</TD></TR>
 * <TR><TD>данные об изделии</TD><TD>\ref p1_s3_2_27 "3.2.27"</TD></TR>
 * <TR><TD>данные</TD><TD>\ref p1_s3_2_14 "3.2.14"</TD></TR>
 * <TR><TD>заявка о соответствии реализации протоколу</TD><TD>\ref p1_s3_2_30 "3.2.30"</TD></TR>
 * <TR><TD>изделие</TD><TD>\ref p1_s3_2_26 "3.2.26"</TD></TR>
 * <TR><TD>интегрированные ресурсы</TD><TD>\ref p1_s3_2_22 "3.2.22";\ref p1_s4_2_1 "4.2.1"; \ref p1_s6 "6";\ref p1_s7 "7"</TD></TR>
 * <TR><TD>интерпретация</TD><TD>\ref p1_s3_2_23 "3.2.23"</TD></TR>
 * <TR><TD>информационная модель изделия</TD><TD>\ref p1_s3_2_29 "3.2.29"</TD></TR>
 * <TR><TD>информационная модель</TD><TD>\ref p1_s3_2_21 "3.2.21"</TD></TR>
 * <TR><TD>информация об изделии</TD><TD>\ref p1_s3_2_26 "3.2.26"</TD></TR>
 * <TR><TD>информация</TD><TD>\ref p1_s3_2_20 "3.2.20"</TD></TR>
 * <TR><TD>класс соответствия</TD><TD>\ref p1_s3_2_12 "3.2.12"</TD></TR>
 * <TR><TD>комплект абстрактных тестов</TD><TD>\ref p1_s3_2_1 "3.2.1";\ref p1_s5 "5";\ref p1_s10 "10"</TD></TR>
 * <TR><TD>комплектующее</TD><TD>\ref p1_s3_2_11 "3.2.11"</TD></TR>
 * <TR><TD>методы описания</TD><TD>\ref p1_s5 "5"</TD></TR>
 * <TR><TD>методы реализации</TD><TD>\ref p1_s3_2_19 "3.2.19";\ref p1_s5 "5";\ref p1_s8_3 "8.3";\ref p1_s11_4 "11.4"</TD></TR>
 * <TR><TD>обмен данными</TD><TD>\ref p1_s3_2_15 "3.2.15"</TD></TR>
 * <TR><TD>обобщённые ресурсы</TD><TD>\ref p1_s3_2_18 "3.2.18";\ref p1_s4_2_1 "4.2.1";\ref p1_s5 "5"</TD></TR>
 * <TR><TD>представление</TD><TD>\ref p1_s3_2_25 "3.2.25"</TD></TR>
 * <TR><TD>прикладная интерпретированная модель</TD><TD>\ref p1_s3_2_5 "3.2.5";\ref p1_s8_2 "8.2"</TD></TR>
 * <TR><TD>прикладная функциональная модель</TD><TD>\ref p1_s3_2_3 "3.2.3";\ref p1_s8_1 "8.1"</TD></TR>
 * <TR><TD>прикладная эталонная модель</TD><TD>\ref p1_s3_2_8 "3.2.8";\ref p1_s8_1 "8.1"</TD></TR>
 * <TR><TD>прикладной контекст</TD><TD>\ref p1_s3_2_4 "3.2.4"</TD></TR>
 * <TR><TD>прикладной объект</TD><TD>\ref p1_s3_2_6 "3.2.6"</TD></TR>
 * <TR><TD>прикладной протокол</TD><TD>\ref p1_s3_2_7 "3.2.7"; \ref p1_s3_3 "3.3";\ref p1_s5 "5";\ref p1_s8 "8"</TD></TR>
 * <TR><TD>прикладные ресурсы</TD><TD>\ref p1_s3_2_9 "3.2.9";\ref p1_s4_2_1 "4.2.1";\ref p1_s5 "5"</TD></TR>
 * <TR><TD>приложение</TD><TD>\ref p1_s3_2_2 "3.2.2"</TD></TR>
 * <TR><TD>сборочная единица</TD><TD>\ref p1_s3_2_10 "3.2.10"</TD></TR>
 * <TR><TD>структура обмена</TD><TD>\ref p1_s3_2_17 "3.2.17"</TD></TR>
 * <TR><TD>структура ресурса</TD><TD>\ref p1_s3_2_31 "3.2.31"</TD></TR>
 * <TR><TD>структура</TD><TD>\ref p1_s3_2_32 "3.2.32"</TD></TR>
 * <TR><TD>требование соответствия</TD><TD>\ref p1_s3_2_13 "3.2.13";\ref p1_s8_4 "8.4"</TD></TR>
 * <TR><TD>форма ЗСРП</TD><TD>\ref p1_s3_2_24 "3.2.24"</TD></TR>
 * <TR><TD>функциональная единица</TD><TD>\ref p1_s3_2_33 "3.2.33"</TD></TR>
 * <TR><TD>части</TD><TD>\ref p1_foreword "Введение"</TD></TR>
 * <TR><TD>язык определения данных</TD><TD>\ref p1_s3_2_16 "3.2.16"</TD></TR>
 * </TABLE>
 *
\latexonly
\setlength{\parindent}{0mm} 
\endlatexonly
 * \}
 */

#endif /* _10303_1_DOC_H */
