/**
 * \file
 *
 * \brief Заголовочный файл с определением кодов ошибок (завершения программы)
 */

#ifndef _ERR_H
#define _ERR_H

/**
 * \brief Определения констант кодов ошибки (завершения программы)
 */
enum class err_enum_t {
/** Ошибок нет, всё в порядке.                */
  ERROR_OK         =  0,
/** Ошибка формата командной строки.          */
  ERROR_CMD_FORMAT = -1,
/** Ошибка чтения/записи файла.               */
  ERROR_FILE_IO    = -2,
/** Ошибка при импорте файла STL.             */
  ERROR_IMPORT     = -3,
/** Внутренняя ошибка, котоой не должно быть. */
  ERROR_INTERNAL   = -4
};

#endif /* _ERR_H */
